gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
/*
Wasserstand_V7
Renamed to new version, because of changes in graphs ..
=============================================
Wasserstand_V5
V6.9
- Pumpensteuerung implementiert
  - sechster Alarmlevel, der gleich zwei Pumpenstartet
  - Betriebszeit der Pumpen in Datei gespeichert
- Messdaten zur grafischen Aufbereitung werden zur bplaced-Seite geschickt
  - schicken der Daten
  - ablegen in Datenbank
  - lesen aus Datenbank und einfache Grafik
=============================================
Wasserstand_V5
V6.4
- Hysteresis added at alarmStateLevel
=============================================
Wasserstand_V5
V6.3
- System running and tested
=============================================
Wasserstand_V5
V6.0
- both builds OK
- tests are to be done
=============================================
Wasserstand_V5
V5.3
- runs OK on ESP32
- some bugs fixed 
  - crash with sending mail
  - crash because overload of string
next step: adapt to ESP 8266
=============================================
Wasserstand_V4

Transferred to Visual Studio Code

including following features:
- Wasserstand abfragen anhand von vier Relais Ausgängen
- Aktiven Bereich anzeigen
- Hintergrundfarbe abhängig von Warn- oder Alarmlevel
- Info auf WebSeite anzeigen
- Beim Wechsel auf einen gefährlichen Zustand und zurück werden Info Mails (Text-Mail) gesendet

-----------------------------
V4.5
- simulation of changing pegel
- code for longtime values added
-   - extra ring buffers
-   - procedure to display graph
- some optimizations to save RAM space
-   - generate strings for graph where it is needed
-   - return from subprogram releases this RAM space at return
-   - ringbuffer for time now holds epochtime (unsigned long); conversion into string is done at handleGraph procedure
-----------------------------
V4.4
- code reworked (delete unused variables, separat code into own files)
-----------------------------
V4.3
- Show actual value on main-page
- Show history of values on page ListFiltered
-----------------------------
V4.2
Display as graph
------------------------------
V4.1
analog functions added

next steps
  - show values via Web
  - 
------------------------------
V4.0
no changes in features. Compiles now without error and warning on vscode
functions are separated in several source files

------------------------------
V2.2
----
fixed issues:
- actual date/time is actually not evaluated to avoid crash when sending email --> this has to be fixed next (unset debug_crash to reactivate)

new features implemented
- HTML Mail
  - Hyperlink auf die Hauptseite

new features comming soon:
- HTML Mail mit Farbe
- Testmail per klick

known issues: OTA download not possible "not enouth space"
-----------------------------------------------------------


*/

/************************************ */
/* includes                           */
/************************************ */
#include <waterlevel_defines.h>

#if BOARDTYPE == ESP32
  #include <Arduino.h>

  #include <waterlevel.h>

  #include <ESP_Mail_Client.h>
  #include <WiFi.h>
  #include <WiFiClient.h>
  #include <WebServer.h>
  #include <ESPmDNS.h>

// use time.h from Arduino.h 
#include "time.h"                   // for time() ctime()



  #include "soc/soc.h"            // disable brownout detector
  #include "soc/rtc_cntl_reg.h"   // disable brownout detector

  WebServer server(80);

  #include <server.h>
  #include <timeserver.h>
  #include <NoiascaCurrentLoop.h>   // library for analog measurement
  #include <EvaluateSensor.h>


  #include <ProjClient.h>

  #include <pumpControl.h>
  
  #include <MyLittleFSLib.h>

#else // ESP8266
  #include <Arduino.h>
  
  #include <ESP8266WiFi.h>
  #include <WiFiClient.h>
  #include <ESP8266WebServer.h>

  #include <waterlevel.h>

  #include <ESP_Mail_Client.h>
  #include <ESP8266mDNS.h>  // Bonjour/multicast DNS, finds the device on network by name

  #include <server.h>
  #include <timeserver.h>
  #include <NoiascaCurrentLoop.h>   // library for analog measurement
  #include <EvaluateSensor.h>

  #include <ProjClient.h>
  #include <LittleFS.h>

  #include <pumpControl.h>
  
  #include <MyLittleFSLib.h>
#endif

// #include <TelnetStream.h>
// #include <debugPrint.h>

#include <ElegantOTA.h>
#include "esp_task_wdt.h"  // Include ESP32 Watchdog Timer library

#if MyUSE_ADC == ADS1115_ADC
  #if BOARDTYPE == ESP32
    #include <Wire.h>
    #include <Adafruit_Sensor.h>
    #include <Adafruit_ADS1X15.h>
    TwoWire I2CSensors = TwoWire(0);
    Adafruit_ADS1115 ads;
    int16_t adc0;
  #else
    #include <Adafruit_ADS1X15.h>
    #include <Wire.h>
    
    Adafruit_ADS1115 ads;

    int16_t adc0;
  #endif
#endif


extern CurrentLoopSensor currentLoopSensor();


#include <ProjClient.h>


/********************************************************************
         Globals - Variables and constants
 ********************************************************************/

unsigned long seconds_since_startup = 0;      // current second since startup

unsigned long previousMillis = 0;             // used to determine intervall of ADC measurement
unsigned long millisNow      = 0;  

const uint16_t ajaxIntervall = 5;             // intervall for AJAX or fetch API call of website in seconds
uint32_t clientPreviousSs = 0;                // - clientIntervall;  // last second when data was sent to server

#if isLiveSystem == 1  /* dont send */
  const uint16_t clientIntervall = CLIENT_INTERVALL_LIFE;         // intervall to send data to a server in seconds. Set to 0 if you don't want to send data
                                               // live systen shall not send anything for now
#else
  const uint16_t clientIntervall = CLIENT_INTERVALL_DEV;       // intervall to send data to a server in seconds. Set to 0 if you don't want to send data
#endif

// select http url to send to: 
//  - send to Bplaced or an internal device
//  - select if it is a live system or development
#if isLiveSystem == 1
  const char *sendHttpTo = "https://zehentner.bplaced.net/Wasserstand/live/data_sql.php"; // the module will send information to that server/resource. Use an URI or an IP address
#else
  const char *sendHttpTo = "https://zehentner.bplaced.net/Wasserstand/dev/data_sql.php"; // the module will send information to that server/resource. Use an URI or an IP address
#endif




