gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
  // TelnetStream.println("");
  // TelnetStream.print("Connected to ");
  // TelnetStream.println(ssid);
  // TelnetStream.print("IP address: ");
  // TelnetStream.println(WiFi.localIP());


  #if BOARDTYPE == ESP32

    if (MDNS.begin("esp32")) {
      Serial.println("MDNS responder started");
    }
    #else
    
    if (MDNS.begin("esp8266")) {
      Serial.println(F("MDNS responder started"));
      }
    #endif
  /*=================================================================*/
  /*====================   Prepare SendMail */

  MailClient.networkReconnect(true);
  smtp.debug(0);

  smtp.callback(smtpCallback);

  config.server.host_name = SMTP_HOST;
  config.server.port = SMTP_PORT;
  config.login.email = AUTHOR_EMAIL;
  config.login.password = AUTHOR_PASSWORD;

  config.login.user_domain = F("127.0.0.1");

  /*=================================================================*/
  /*====================   Prepare connection to timeserver */

  #if BOARDTYPE == ESP32
    // ESP32 
    configTime(0, 0, MY_NTP_SERVER);  // 0, 0 because we will use TZ in the next line
    setenv("TZ", MY_TZ, 1);            // Set environment variable with your time zone
    tzset();
  #else
    // ESP8266
    configTime(MY_TZ, MY_NTP_SERVER);    // --> for the ESP8266 only
  #endif


  /*=================================================================*/
  /* Prepare WaterLevel Application */

  // prepare relais input / output

  pinMode(GPin_AHHH, INPUT_PULLUP);
  pinMode(GPin_AHH,  INPUT_PULLUP);
  pinMode(GPin_AH,   INPUT_PULLUP);
  pinMode(GPin_AL,   INPUT_PULLUP);

  digitalWrite(GPout_pump1,0);
  digitalWrite(GPout_pump2,0);
  pinMode(GPout_pump1, OUTPUT);
  pinMode(GPout_pump2, OUTPUT);


 
  /* ----End Setup WaterLevel ------------------------------------------ */
  /*=================================================================*/

  /*=================================================================*/
  /*=================================================================*/
  /* Setup WebServer and start*/
  /*=================================================================*/
  
  // define the pages and other content for the webserver
  server.on("/", handlePage);      // send root page
  server.on("/0.htm", handlePage); // a request can reuse another handler
  server.on("/graph.htm", handleGraph); // display a chart with shortterm values
  server.on("/filtered.htm",handleListFiltered);

  server.on("/f.css", handleCss); // a stylesheet
  server.on("/j.js", handleJs);   // javscript based on fetch API to update the page
  server.on("/json", handleJson);    // send data in JSON format
  server.on("/c.php", handleCommand);            // process commands
                                     
  server.onNotFound(handleNotFound); // show a typical HTTP Error 404 page
  
  // the next two handlers are necessary to receive and show data from another module
  server.on("/d.php", handleData);               // receives data from another module
  server.on("/r.htm", handlePageR);              // show data as received from the remote module
  
  server.on("/ota.htm", []() {
      server.send(200, "text/plain", "Hi! This is ElegantOTA Demo.");
  });

  ElegantOTA.begin(&server);    // Start ElegantOTA
  server.begin(); // start the webserver
  Serial.println(F("HTTP server started"));
  /*=====================   end fo prepare webserver  ===============*/
  
  


  
  /*=================================================================*/
  beginCurrentLoopSensor();
  
  Serial.print("is_life_system: ");
  Serial.println(isLiveSystem);
  
  #if MyUSE_ADC == ADS1115_ADC
    /*==================================================================*/
    // Prepare analog output
    //  pinMode(LED_PIN, OUTPUT);

    #if BOARDTYPE == ESP32
    /*==================================================================*/
    // prepare I2C interface
      Serial.println("I2CSensors.begin");
      I2CSensors.begin(I2C_SDA, I2C_SCL, 100000);
    #endif

    /*==================================================================*/
    // prepare analog read from ads1115 via I2C
    // ADS 1115 (0x48 .. 0x4B will be the address)
    #if BOARDTYPE == ESP8266
      Wire.begin(I2C_SDA,I2C_SCL);
    #endif

    // check if ADS is runnint
    #if BOARDTYPE == ESP32
      // for ESP32
      Serial.println("ads.begin");
      if (!ads.begin(0x48, &I2CSensors))
    #else
      // for ESP 8266
      if (!ads.begin())
    #endif
    {
      Serial.println("Couldn't Find ADS 1115");
      //while  (1) // endless loop is not good, because ESP is not updatable by OTA
        ;
    }
    else
    {
      Serial.println("ADS 1115 Found");
      ads.setGain(GAIN_ONE);
      Serial.print("Gain: ");
      Serial.println(ads.getGain());
    }

    #if BOARDTYPE == ESP32
      // PSRAM available?
      log_d("Total heap: %d", ESP.getHeapSize());
      log_d("Free heap: %d", ESP.getFreeHeap());
      log_d("Total PSRAM: %d", ESP.getPsramSize());
      log_d("Free PSRAM: %d", ESP.getFreePsram());
    #endif
  #endif

  //==========================================
  // prepare logfile
  bool fsOK = false;

  Serial.println("Mount LittleFS");

  if (!LittleFS.begin()) {
    Serial.println("LittleFS mount failed, trying to format");

    if (!LittleFS.format()) {
        Serial.println("LittleFS format failed");

    } else {
 
        Serial.println("format succeeded, try to mount agait");
        if (!LittleFS.begin()) {
          Serial.println("mount failed again");
        } else {
          Serial.println("mount succeeded");
          fsOK = true;
        }
    }
  } else {
    fsOK = true;
  }
 
 if (fsOK) {
 
          //=============================================================================================
          // handling setup.ini
          //=============================================================================================
          #if deleteSetupFile == 1
            // deleting setupFile
            Serial.println("deleting setupFile");
            deleteFile("/setup.ini");
          #else
            Serial.println("NOT!!! deleting setup.ini");
          #endif

          getSetupIni();
          //readFile("/setup.ini");
          Serial.println();
          Serial.print("pump1_operationTime : ");Serial.println(pump1_operationTime);
          Serial.print("pump2_operationTime : ");Serial.println(pump2_operationTime);
          Serial.print("linkPump            : ");Serial.println(linkPump);

          //=============================================================================================
          // handling error lot
          //=============================================================================================
          #if deleteErrLog == 1
            // deleting setupFile
            Serial.println("deleting error.log");
            deleteFile("/error.log");
          #else
            Serial.println("NOT!!! deleting error.log");
          #endif
          if (!LittleFS.exists("/error.log")) {
            Serial.println("error.log doesnt exist; generating a new one");
            
            String errMessage = "";
            errMessage =  currentDate ;
            errMessage += " - " ;
            errMessage += formattedTime; 
            errMessage += " - " ;
            errMessage +=  "init error-file\n";
            appendFile("/error.log", errMessage.c_str());
          }

          readFile("/error.log");
        }
  
    //listDir("/");  

  // Initialize the Watchdog Timer
  esp_task_wdt_init(WDT_TIMEOUT, true);  // Enable panic so ESP32 resets
  esp_task_wdt_add(NULL);  // Add the current task (loop) to the Watchdog

