gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
    if (!MailClient.sendMail(&smtp, &message, false))
      MailClient.printf("Error, Status Code: %d, Error Code: %d, Reason: %s\n", smtp.statusCode(), smtp.errorCode(), smtp.errorReason().c_str());

  exit:

    heapInfo.collect();
    heapInfo.print();

    /*=END Send_Reuse_Session =====================================*/
  }
  
  // **************************************************************************************************
  // **************************************************************************************************
  /*===========================================================
    simulate changing waterlevel
   */
  #ifdef SIM_FADING_LEVEL
    // change the dutycylce for next time through the loop:
    pegel = pegel + fadeAmount;

    // reverse the direction of the fading at the ends of the fade:
    if (pegel <= Level_ALL/100.0-0.05 || pegel >= Level_AHH/100.0+0.05) {
      fadeAmount = -fadeAmount;
    }
  #endif // SIM_FADING_LEVEL
  // **************************************************************************************************


  // **************************************************************************************************
  #ifdef DEBUG_PRINT_RAW
  // **************************************************************************************************
    if (millis() - previousMillisCyclicPrint > WaitingTimeCyclicPrint)
    {

      /*=================================================================*/
      // read analog value via I2C for debug
      // not used in live system
      //===========================================
      const int loc_maxAdc_value = 0x7FFF;
      float voltage=0.0;

      Serial.println("=================================");
      adc0 = GET_ANALOG;
      //adc0 = ads.readADC_Differential_0_1();
      Serial.print("Analog input pin 0: "); Serial.println(adc0);
      Serial.print("myValueFiltered: "); Serial.println(myValueFiltered);

    // voltage = ads.computeVolts(adc0);   
    // Serial.print("Voltage: "); Serial.println(voltage);
    
      previousMillisCyclicPrint = millis();

    }
   #endif // DEBUG_PRINT_RAW
  // **************************************************************************************************
    // generate a time tick for cyclic operations; e.g. debug print, but also blink LED
   if (millis() - previousMillisCyclicPrint > WaitingTimeCyclicPrint)
    {
      timeTickForCyclicPrint = 1;
      previousMillisCyclicPrint = millis();
    } else {
      timeTickForCyclicPrint = 0;
    } 
  
    // **************************************************************************************************
    #ifdef DEBUG_PRINT_CYCLIC
    // **************************************************************************************************
        // Serial.print(formattedTime);
        // heapInfo.collect();
        // heapInfo.print();
        
        //Serial.print("millisNow : ");Serial.print(opTime_millisNow);Serial.print(" millisDiff : ");Serial.println(opTime_millisDiff);
        // Serial.print(myValueFilteredAct);
        // Serial.print(" - AlarmStateLevel: "); Serial.print(alarmStateLevel);
        // Serial.print("  ");
        // Serial.print("  pumpA: "); Serial.print(pumpA_op); Serial.print("  Op time 1 : "); Serial.print(pump1_operationTime);
        // Serial.print("  pumpB: "); Serial.print(pumpB_op); Serial.print("  Op time 2 : "); Serial.print(pump2_operationTime);
        // Serial.print(" linkPump : ");Serial.println(linkPump);
        
        // TelnetStream.println("Test TelnetStream: ");
        // log();

        
    #endif

    if (timeTickForCyclicPrint == 1) {
      if (digitalRead(builtin_led) == HIGH) {
        digitalWrite(builtin_led, LOW);
      } else {
        digitalWrite(builtin_led, HIGH);
      }
    }

    String errMessage = "";

    errMessage =  currentDate ;
    errMessage += " - " ;
    errMessage += formattedTime; 
    errMessage += " - " ;
    errMessage +=  "client connection error - restart triggered\n";
    //   appendFile("/error.log", errMessage.c_str());
    //   ESP.restart();
  // Telnetstream read
  //   switch (TelnetStream.read()) {
  //   case 'R':
  //   TelnetStream.stop();
  //   delay(100);
  //   ESP.restart();
  //     break;
  //   case 'C':
  //     TelnetStream.println("bye bye");
  //     TelnetStream.flush();
  //     TelnetStream.stop();
  //     break;
  // }

  // static unsigned long next;
  // if (millis() - next > 5000) {
  //   next = millis();
  //   log();
  // }



  controlPump();
  selectPump();
  measureOperatingTime();
  

  // input command via serial interface
  //**************************************************************************************


  millisNow = millis();

  if (millisNow - lastMillis >= 2000) {
    lastMillis = millisNow;
    doPrint = 1;

    //Serial.println(".");
    value ++;
  }

  // serial input is not yet working reliably
#ifdef useSerialInput
// if there's any serial available, read it:
  if (Serial.available() > 0) {

    receivedString= Serial.readString();

    Serial.println();
    Serial.println("rec: " + receivedString) + "---";
    Serial.println(";");

    Serial.println("len: " + (receivedString.length()));

    if (receivedString == "r") {
      Serial.println("executing readFile");
      
    }    
   }
   #endif //useSerialInput

   
  
  // **************************************************************************************************
  // set a delay to avoid ESP is busy all the time
  //     allow the cpu to switch to other tasks
  
  delay(2);

  doPrint = 0;
  printOnChangeActive = 0;
  // **************************************************************************************************
  // **************************************************************************************************
} // end void loop()
  // **************************************************************************************************
  // **************************************************************************************************


/* Callback function to get the Email sending status */
void smtpCallback(SMTP_Status status)
{

  Serial.println(status.info());

  if (status.success())
  {

    Serial.println(F("----------------"));
    MailClient.printf("Message sent success: %d\n", status.completedCount());
    MailClient.printf("Message sent failed: %d\n", status.failedCount());
    Serial.println(F("----------------\n"));

    for (size_t i = 0; i < smtp.sendingResult.size(); i++)
    {
      SMTP_Result result = smtp.sendingResult.getItem(i);

      MailClient.printf("Message No: %d\n", i + 1);
      MailClient.printf("Status: %s\n", result.completed ? "success" : "failed");
      MailClient.printf("Date/Time: %s\n", MailClient.Time.getDateTimeString(result.timestamp, "%B %d, %Y %H:%M:%S").c_str());
      MailClient.printf("Recipient: %s\n", result.recipients.c_str());
      MailClient.printf("Subject: %s\n", result.subject.c_str());
    }
    Serial.println("----------------\n");

    smtp.sendingResult.clear();
  }
}

//*******************************************************************************
// read values out of setup.ini
void getSetupIni()
//*******************************************************************************
{
  // check if file exists, if not, generate one with zero values
  if (!LittleFS.exists("/setup.ini"))
  {
    Serial.println("setup.ini does not exist / generate a new file");
    Serial.println("Calling putSetupIni");
    putSetupIni();
  }
  // open file for reading
  File file = LittleFS.open("/setup.ini", "r");
  if (!file) {
    Serial.println("Failed to open setup.ini for reading");
    return;
  } else {
    Serial.println("setup.ini successfully opened for reading");
  }

  // read from file line by line
  // prepare loop
  // define locals
  char c;
  String FileContent="";
  String fileLine="";
  int isToken  = 1;
  String tokenName  ="";
  String tokenValue ="";
    
  while (file.available()) { 

    c = file.read();

    if  (c=='\n'){
      // with every new line decode setting
        if (tokenName == "pump1_operationTime") {
            pump1_operationTime = tokenValue.toInt();
        }
        if (tokenName == "pump2_operationTime") {
            pump2_operationTime = tokenValue.toInt();
        }
        if (tokenName == "linkPump") {
            linkPump = tokenValue.toInt();
        }

        // and prepare for next line
        isToken=1;
        tokenName="";
        tokenValue="";

        } else if (c=='='){
        // with every equ switch to value
        isToken=0;
        } else if (c==' '){
        // space: do nothing
        } else {

        // get char and add to appropriate string
        if (isToken==1){
            tokenName+= c;
        } else {
            tokenValue+= c;
        }
    }
    //noValues ++;
  }
  file.close();

}
//*******************************************************************************
// write values to setup.ini
void putSetupIni()
//*******************************************************************************
{
    Serial.println("putSetupIni entered");
    String tempString="";

    tempString += String("pump1_operationTime=") ;
    tempString += String(pump1_operationTime);
    tempString += String(";\npump2_operationTime=");
    tempString += String(pump2_operationTime);
    tempString += String(";\nlinkPump=");
    tempString += String(linkPump);
    tempString += String(";\n");

    writeFile("/setup.ini", (tempString).c_str()); // Append data to the file
    Serial.println("data appended");
  
        
}  

  // void log() {
//   static int i = 0;

//   char timeStr[20];
//   // sprintf(timeStr, "%02d-%02d-%02d %02d:%02d:%02d", year(), month(), day(), hour(), minute(), second());

//   TelnetStream.print(i++);
//   TelnetStream.print(" ");
//   TelnetStream.print(timeStr);
//   TelnetStream.print(" A0: ");
//   TelnetStream.println(analogRead(A0));
// }